---
type: IMemberForcesServer
namespace: Autodesk.Revit.DB.Structure
version: 2024
members: 1
tags: [revit-api, class]
---

# IMemberForcesServer

`Autodesk.Revit.DB.Structure.IMemberForcesServer` · Revit 2024 · 1 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | MemberForcesUpdate | 2015 | `bool MemberForcesUpdate ( MemberForcesServiceData data )` |